Repository: pavluk/RishMacOSTools
Catalog: Localizable.xcstrings
Source language: en
Languages: ru, uk

# %@ clipboard.message
source: The ‘%@’ was copied successfully.
ru: ‘%@’ успешно скопировано
uk: ‘%@’ успішно скопійовано

# agent.remove_key_error %@
source: Error deleting key from agent: %@
ru: Ошибка удаления ключа из агента: %@
uk: Помилка видалення ключа з агента: %@

# agent.remove_key_success
source: The key has been removed from the agent
ru: Ключ был удален из агента
uk: Ключ був вилучений з агента

# agent.remove_keys_success
source: All keys have been removed from the agent
ru: Все ключи удалены из агента
uk: Всі ключі були видалені з агента

# backup.error
source: Backup not restored
ru: Бэкап не востановлен
uk: Бекап не відновлено

# backup.success
source: Backup restored
ru: Бэкап востановлен
uk: Бекап відновлено

# button.cancel
source: Cancel
ru: Отмена
uk: Скасувати

# button.create_key
source: Create key
ru: Создать ключ
uk: Створити ключ

# button.create_public_key
source: Create public key
ru: Создать публичный ключ
uk: Створити відкритий ключ

# button.delete_key
source: Delete key
ru: Удалить ключ
uk: Видалити ключ

# button.delete_server
source: Delete server
ru: Удалить сервер
uk: Видалити сервер

# button.delete.known_hosts
source: Clear known_hosts
ru: Очистить known_hosts
uk: Очистити known_hosts

# button.generate_key
source: Generate key
ru: Сгенерировать ключ
uk: Згенерувати ключ

# button.insert_key
source: Insert Key
ru: Вставить ключ
uk: Вставити ключ

# button.key_comment_edit
source: Edit Key Comment
ru: Редактировать комментарий
uk: Редагувати коментар ключа

# button.key_edit_comment
source: Edit comment
ru: Редактировать комментарий
uk: Редагувати коментар

# button.keys_reload
source: Update list
ru: Обновить список
uk: Оновити список

# button.open_folder_ssh
source: Go to .ssh folder
ru: Открыть папку .ssh
uk: Перейти до папки .ssh

# button.remove_keys_from_agent
source: Clear SSH agent
ru: Очистить SSH агент
uk: Очистити SSH агент

# button.server_create
source: Create server
ru: Добавить сервер
uk: Додати сервер

# button.server_edit
source: Edit server
ru: Редактировать сервер
uk: Редагувати сервер

# button.server_export_all.iterm
source: Export all for ITerm
ru: Экспортировать все для ITerm
uk: Экспортировати всі для ITerm

# button.server_export.iterm
source: Export for ITerm
ru: Экспортировать для ITerm
uk: Експортувати для ITerm

# clipboard.message
source: Value has been copied to clipboard
ru: Значение скопировано в буфер обмена.
uk: Значення було скопійовано в буфер обміну

# clipboard.title
source: Copied to Clipboard
ru: Скопировано в буфер обмена
uk: Скопійовано до буфера обміну

# config.error.append %@
source: Error append server ‘%@’
ru: Ошибка добавления сервера ‘%@’
uk: Помилка додавання сервера

# error_unknown
source: Unknown error
ru: Неизвестная ошибка
uk: Невідома помилка

source: Error delete known_hosts ‘%@’
ru: Ошибка при удалении known_hosts
uk: Помилка видалення known_hosts ‘%@’

# key.delete_error %@
source: Error deleting key: %@
ru: Ошибка при удалении ключа: %@
uk: Помилка видалення ключа: %@

# key.delete_success
source: The key was successfully deleted
ru: Ключ успешно удален
uk: Ключ успішно видалено

# key.exist
source: The key already exists
ru: Ключ уже существует
uk: Ключ уже існує

# key.generate_error %@
source: Key generation error: %@
ru: Ошибка генерации ключа: %@
uk: Помилка генерації ключа: %@

# key.generate_success
source: The key has been generated
ru: Ключ сгенерирован
uk: Ключ згенеровано

# key.not_exist
source: The key does not exist
ru: Ключ не существует
uk: Ключ не існує

# key.private.error_empty
source: Empty key is not allowed
ru: Пустой ключ не допускается
uk: Порожній ключ не допускається

# key.private.error_format
source: The key format is incorrect or the key is incomplete
ru: Формат ключа неверен или ключ неполный
uk: Формат ключа неправильний або ключ неповний

# key.private.save_error %@
source: Error saving key: %@
ru: Ошибка сохранения ключа: %@
uk: Помилка збереження ключа:%@

# key.private.save_success
source: Key saved successfully
ru: Ключ успешно сохранен
uk: Ключ успішно збережено

# key.public.comment_edit_success
source: Comment successfully updated!
ru: Комментарий успешно обновлен!
uk: Коментар успішно оновлено!

# key.public.comment_not_found
source: Comment not found
ru: Комментарий не существует
uk: Коментар не існує!

# key.public.edit_error %@
source: Comment edit error ‘%@’
ru: Ошибка редактирования ‘%@’
uk: Помилка редагування ‘%@’

# key.public.exist
source: The public key already exists
ru: Публичный ключ уже существует
uk: Публічний ключ вже існує

# key.public.generate_error %@
source: Error saving public key: %@
ru: Ошибка при сохранении публичного ключа: %@
uk: Помилка збереження публічного ключа: %@

# key.public.get_error
source: Error getting public key
ru: Ошибка получения публичного ключа
uk: Помилка отримання публічного ключа

# key.public.not_exist
source: Comment does not exist!
ru: Комментарий не существует
uk: Коментар не існує!

# key.public.save_error
source: Error saving public key
ru: Ошибка при сохранении публичного ключа
uk: Помилка при збереженні публічного ключа

# key.public.save_success
source: The public key was successfully saved
ru: Публичный ключ успешно сохранен
uk: Публічний ключ успішно збережено

# label.key_comment
source: Key comment
ru: Комментарий к ключу
uk: Коментар до ключа

# label.key_name
source: Name key:
ru: Название ключа
uk: Назва ключа:

# label.key_name %@
source: Name key: %@
ru: Название ключа ‘%@’
uk: Назва ключа ‘%@’

# label.key_path
source: Path key:
ru: Путь ключа
uk: Шлях до ключа

# label.key_public
source: Public key
ru: Публичный ключ
uk: Відкритий ключ

# label.secret_key
source: Secret key
ru: Секретный ключ
uk: Секретний ключ

# label.server_command
source: Server command:
ru: Команда для сервера
uk: Команда для сервера

# label.server_host
source: Host
ru: Имя сервера (Host)
uk: Ім'я сервера (Host)

# label.server_hostname
source: Hostname
ru: Адрес (Hostname)
uk: Адреса (Hostname)

# label.server_user
source: User
ru: Пользователь
uk: Користувач

# option.key.select
source: - Select key -
ru: - Выбрать ключ -
uk: - Вибрати ключ -

# rish_link_text
source: Go to the website rish.su
ru: Перейти на сайт rish.su
uk: Перейти на сайт rish.su

# server.append.success
source: Server added successfully
ru: Сервер успешно добавлен
uk: Сервер успішно додано

# server.delete '%@'?
source: Delete server ‘%@’
ru: Удалить сервер ‘%@’
uk: Видалити сервер ‘%@’

# server.edit.success
source: Server edeting success
ru: Сервер успешно отредактировано
uk: Сервер успішно змінено

# server.error.ssh %@
source: Error connect to server
ru: Не удалось подключится к серверу
uk: Помилка підключення до сервера

# server.exist.host
source: Server exists
ru: Сервер уже существует
uk: Сервер існує

# server.key_not_found
source: Server not found
ru: Выберите ключ
uk: Сервер не знайденно

source: Server not exist
ru: Сервер не существует
uk: Сервер не існує

# server.remove.success
source: Server delete success
ru: Сервер успешно удален
uk: Сервер успішно видалено

# success.delete.known_hosts
source: File known_hosts delete success
ru: known_hosts удален
uk: Файл known_hosts видалено

# title.delete_key '%@'?
source: Delete key %@
ru: Удалить ключ ‘%@’
uk: Видалити ключ ‘%@’

# title.server_edit %@
source: Edit server ‘%@’
ru: Редактирование сервера ‘%@’
uk: Редагування серверу ‘%@’

# view.keyDetails_name %@
source: Key information %@
ru: Информация по ключу %@
uk: Інформація ключа %@

# view.keys_name
source: Keys
ru: Ключи
uk: Ключі

# view.servers_name
source: Servers
ru: Сервера
uk: Сервера
